driver-tests/bpelse/nmproperty/dynamicaddressingNMproperty/src/dynamicaddressingNMPA.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="dynamicaddressingNMPA" targetNamespace="http://j2ee.netbeans.org/wsdl/dynamicaddressingNMproperty/dynamicaddressingNMPA"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/dynamicaddressingNMproperty/dynamicaddressingNMPA" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types/>
    <message name="dynamicaddressingNMPAOperationRequest">
        <part name="part1" type="xsd:string"/>
    </message>
    <message name="dynamicaddressingNMPAOperationResponse">
        <part name="part1" type="xsd:string"/>
    </message>
    <portType name="dynamicaddressingNMPAPortType">
        <operation name="dynamicaddressingNMPAOperation">
            <input name="input1" message="tns:dynamicaddressingNMPAOperationRequest"/>
            <output name="output1" message="tns:dynamicaddressingNMPAOperationResponse"/>
        </operation>
    </portType>
    <binding name="dynamicaddressingNMPABinding" type="tns:dynamicaddressingNMPAPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="dynamicaddressingNMPAOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/dynamicaddressingNMproperty/dynamicaddressingNMPA"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/dynamicaddressingNMproperty/dynamicaddressingNMPA"/>
            </output>
        </operation>
    </binding>
    <service name="dynamicaddressingNMPAService">
        <port name="dynamicaddressingNMPAPort" binding="tns:dynamicaddressingNMPABinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/dynamicaddressingNMPAService/dynamicaddressingNMPAPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="dynamicaddressingNMPA">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="dynamicaddressingNMPAPortTypeRole" portType="tns:dynamicaddressingNMPAPortType"/>
    </plnk:partnerLinkType>
</definitions>
