driver-tests/bpelse/nmproperty/dynamicaddressingNMpropertyCA/test/TestCase4/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dyn="http://j2ee.netbeans.org/wsdl/dynamicaddressingNMproperty/dynamicaddressingNMPA">
  <soapenv:Body>
    <dyn:dynamicaddressingNMPAOperation>
      <part1>http://localhost:18181/Synchronous</part1>
    </dyn:dynamicaddressingNMPAOperation>
  </soapenv:Body>
</soapenv:Envelope>